cf_billing/Documents/энргСобытие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргСобытие</Name>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргСобытия</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСпособСвязи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланируемаяДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МакетПечатнойФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Одинарный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СудСудебныйУчастокДляСА</Name>
					<Comment>Реквизит для судебного акта</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСуды</v8:Type>
						<v8:Type>cfg:CatalogRef.энргСудебныеУчастки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СудебнаяИнстанцияДляСА</Name>
					<Comment>Реквизит для судебного акта</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСудебныеИнстанции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СудьяДляСА</Name>
					<Comment>Реквизит для судебного акта</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СудебныйАктДляСА</Name>
					<Comment>Реквизит для судебного акта</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.энргСтатусыСудебногоАкта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСудебногоАктаДляСА</Name>
					<Comment>Реквизит для судебного акта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСудебногоАктаДляСА</Name>
					<Comment>Реквизит для судебного акта</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВступленияВЗаконнуюСилуДляСА</Name>
					<Comment>Реквизит для судебного акта</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОтветственностиДляСА</Name>
					<Comment>Реквизит для судебного акта</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.энргИсполнительнаяОтветственностьПИР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтправки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСпособыОтправкиУведомлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВРамкахЭтапа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыОперацийПИД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласующий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Абоненты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Абонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
								<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:TaskRef.энргЗадачаПИД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Успех</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDЭтапа</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.бестПараметрыТиповСобытий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бестПараметрыТиповСобытий</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПросуженнаяЗадолженность</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Потребитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задолженность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаГоспошлин</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Прочие</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/энргСобытия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСобытия</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Успех</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСпособСвязи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:TaskRef.энргЗадачаПИД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПланируемаяДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>IDЭтапа</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргСтатусВыполненияСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСтатусВыполненияСобытий</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Comment>Указывает выполнено ли событие или нет</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргСобытие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Documents/энргСобытие/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	//ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = ПользователиКлиентСервер.АвторизованныйПользователь();
	КонецЕсли;
	
	Основание 		= Неопределено;
	ОснованиеЗамена = Неопределено;
	Если ДополнительныеСвойства.Свойство("Основание", Основание) И ДополнительныеСвойства.Свойство("ОснованиеЗамена", ОснованиеЗамена) Тогда
	    Для каждого СтрокаТЧ Из Абоненты Цикл
			Если СтрокаТЧ.Основание = Основание Тогда 
				СтрокаТЧ.Основание = ОснованиеЗамена;
			КонецЕсли;
		КонецЦикла;
		
		ДвиженияСоб = Движения.энргСобытия;
		ДвиженияСоб.Прочитать();
		
		Для каждого ЗаписьРС Из ДвиженияСоб Цикл
			Если ЗаписьРС.Основание = Основание Тогда 
				ЗаписьРС.Основание = ОснованиеЗамена;
			КонецЕсли;
		КонецЦикла;
		
		ДвиженияСоб.Записать(Истина);
		ЭтоНовый 				= Не ЗначениеЗаполнено(Ссылка);
		ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый);
	Иначе	
		энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "ЭтоНовый", Ложь) Тогда
		Результат 				= "Событие выполнено успешно";
		МенеджерРегистра 		= РегистрыСведений.энргСтатусВыполненияСобытий;
		ОписаниеОжидаемыхДанных = МенеджерРегистра.ПолучитьОписаниеОбъекта();
		ПериодВыполнения		= ТекущаяДата();
		ОписаниеОжидаемыхДанных.Организация 	= Организация;
		ОписаниеОжидаемыхДанных.Район 			= Район;
		ОписаниеОжидаемыхДанных.ДокРегистратор 	= Ссылка;
		ОписаниеОжидаемыхДанных.Ответственный 	= Пользователи.ТекущийПользователь();
		ОписаниеОжидаемыхДанных.Статус 			= Ложь;
		
		Документы.энргСобытие.ЗарегистрироватьСтатусНеВыполнено(МенеджерРегистра, ПериодВыполнения, ОписаниеОжидаемыхДанных , Результат);
	КонецЕсли;
	

	ЭтоСобытиеСОтправкой = Документы.энргСобытие.ЭтоСобытиеСОтправкой(ТипСобытия);
	
	МассивУдалния = Новый Массив;
	
	НаборЗаписейРС = Движения.энргСобытия;
	НаборЗаписейРС.Прочитать();
	
	Если ПометкаУдаления Тогда
		// Удаление запланированных записей
		Для каждого ЗаписьРС Из НаборЗаписейРС Цикл
			Если (ЗначениеЗаполнено(ЗаписьРС.ПланируемаяДатаОтправки) Или Не ЭтоСобытиеСОтправкой) И Не ЗаписьРС.Успех Тогда
				МассивУдалния.Добавить(ЗаписьРС);
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ЗначениеЗаполнено(ПланируемаяДатаОтправки) И ЭтоСобытиеСОтправкой Тогда	
		// Поиск и, если требуется, создание запланированных записей, для неотправленных строк ТЧ
		Для каждого СтрокаТЧ Из Абоненты Цикл
		    Если СтрокаТЧ.Успех Тогда
				Продолжить;
			КонецЕсли;
			
			ПлановаяЗапись = Неопределено;
			// Поиск уже существующей записи
			Для каждого ЗаписьРС Из НаборЗаписейРС Цикл
				Если ЗаписьРС.Успех Или Не ЗначениеЗаполнено(ЗаписьРС.ПланируемаяДатаОтправки) Или ЗаписьРС.ТипСобытия <> ТипСобытия Тогда
					Продолжить;
				КонецЕсли;
				
				Если ЗаписьРС.Абонент = СтрокаТЧ.Абонент И ЗаписьРС.Основание = СтрокаТЧ.Основание Тогда
					ПлановаяЗапись = ЗаписьРС;
					
					Если ПлановаяЗапись.ПланируемаяДатаОтправки <> ПланируемаяДатаОтправки Тогда
						ПлановаяЗапись.ПланируемаяДатаОтправки = ПланируемаяДатаОтправки;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			// Создание новой записи
			Если ПлановаяЗапись = Неопределено Тогда
				ЗаписьРС = НаборЗаписейРС.Добавить();
				ЗаписьРС.Период					 = ТекущаяДатаСеанса();
				ЗаписьРС.Абонент				 = СтрокаТЧ.Абонент;
				ЗаписьРС.ТипСобытия				 = ТипСобытия;
				ЗаписьРС.Основание				 = СтрокаТЧ.Основание;
				ЗаписьРС.ПланируемаяДатаОтправки = ПланируемаяДатаОтправки;
				ЗаписьРС.Результат				 = СтрокаТЧ.Результат;//Добавлено
			КонецЕсли;
		КонецЦикла;
		
		// Удаление плановых записей, не связанных с ТЧ
		Для каждого ЗаписьРС Из НаборЗаписейРС Цикл
			Если ЗаписьРС.Успех Или Не ЗначениеЗаполнено(ЗаписьРС.ПланируемаяДатаОтправки) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ЗаписьРС.ПланируемаяДатаОтправки <> ПланируемаяДатаОтправки Или ЗаписьРС.ТипСобытия <> ТипСобытия Тогда
				МассивУдалния.Добавить(ЗаписьРС);
			КонецЕсли;
			Отбор = Новый Структура("Абонент, Основание, Успех", ЗаписьРС.Абонент, ЗаписьРС.Основание, Ложь);
			НайденныеСтроки = Абоненты.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() = 0  Тогда
				МассивУдалния.Добавить(ЗаписьРС);
			КонецЕсли;
		КонецЦикла;
	Иначе
		// Просто регистрируем событие
		НаборЗаписейРС.Очистить();
		
		Для каждого СтрокаТЧ Из Абоненты Цикл
			ЗаписьРС = НаборЗаписейРС.Добавить();
			ЗаписьРС.Период		= Дата;
			ЗаписьРС.Абонент	= СтрокаТЧ.Абонент;
			ЗаписьРС.ТипСобытия	= ТипСобытия;
			ЗаписьРС.Основание	= СтрокаТЧ.Основание;
			ЗаписьРС.Результат	= СтрокаТЧ.Результат;
			ЗаписьРС.IDЭтапа	= СтрокаТЧ.IDЭтапа;
			ЗаписьРС.Успех		= СтрокаТЧ.Успех;
		КонецЦикла;
	КонецЕсли;
	
	Для каждого ЗаписьРС Из МассивУдалния Цикл
		НаборЗаписейРС.Удалить(ЗаписьРС);
	КонецЦикла;
	
	// Запись набора
	Если НаборЗаписейРС.Модифицированность() Тогда
		НаборЗаписейРС.Записать(Истина);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции  

Процедура ВыполнитьСобытия(НомераСтрок = Неопределено) Экспорт
	СпрШаблоны			= Справочники.энргШаблоныСообщений;
	ОтправкаУведомления = ТипСобытия = Справочники.энргСпособСвязи.ОтправкаПисьмаНаЭлектроннуюПочту И ЗначениеЗаполнено(МакетПечатнойФормы);
	ОтправкаПоШаблону	= Не ОтправкаУведомления И Не ПустаяСтрока(ТекстШаблона);
	Если ОтправкаПоШаблону Тогда
	 	СписокПарам		= СпрШаблоны.ПолучитьСписокПараметровИзШаблона(ТекстШаблона);
		СписокПарамТемы	= СпрШаблоны.ПолучитьСписокПараметровИзШаблона(ТемаСобытия);
	КонецЕсли;
	ДвиженияСобытияПИР	= Движения.энргСобытия;
	ДвиженияСобытияПИР.Прочитать();

	Если ТипСобытия = Справочники.энргСпособСвязи.ОтправкаПисьмаНаЭлектроннуюПочту Тогда
		ОтправкаПисьмаНаЭлектроннуюПочту(ДвиженияСобытияПИР, ОтправкаУведомления, СписокПарам, СписокПарамТемы, НомераСтрок);
	ИначеЕсли ТипСобытия = Справочники.энргСпособСвязи.ОтправкаСМС Тогда
		ОтправкаSMS(ДвиженияСобытияПИР, СписокПарам, НомераСтрок);
	КонецЕсли;

	Попытка
		ДвиженияСобытияПИР.Записать();
		Записать();
	Исключение
	    ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

Процедура ОтправкаПисьмаНаЭлектроннуюПочту(ДвиженияСобытияПИР, Знач ОтправкаУведомления, СписокПарам, СписокПарамТемы, НомераСтрок)
	
	Перем Тело, Тема, ИмяТемпФайла, ОбластиМакета, Отказ, Отправитель, ПараметрыОтправки, СтрокаТЧ, ТабличныйДокумент;
	Перем ТекстHТМЛ, ТЗ_ЗначенияПарметров, ТипТекста, УдаляемыеФайлы, Этап;
	Перем Абонент, АдресЭП, Вложения, Движение, ДоступныеЗаписи, Задача, ИмяМакета, ИмяПапки, ИмяПапкиИзображений;
	
	МодульМНД		= Документы.энргСобытие;
	ДоступныеЗаписи = РаботаСПочтовымиСообщениями.ДоступныеУчетныеЗаписи(Истина);
	//Отправитель = МодульМНД.ПолучитьУчетнуюЗаписьЭП();
	//Если Не ЗначениеЗаполнено(Отправитель) Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет доступных учетных записей электронной почты.");
	//	Возврат;
	//КонецЕсли;
	Если Не ОтправкаУведомления Тогда 
		Если ПустаяСтрока(ТекстШаблона) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен текст сообщения.");
			Возврат;
		КонецЕсли;
		
		Если ПустаяСтрока(ТемаСобытия) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена тема сообщения.");
			Возврат;
		КонецЕсли;
		
		ТЗ_ЗначенияПарметров = ПолучитьТаблицуЗначенийПараметров();
	КонецЕсли;
	
	ОтработанныеСтроки = Новый Массив;
	
	Для каждого СтрокаТЧ Из Абоненты Цикл
		Если (НомераСтрок <> Неопределено И НомераСтрок.Найти(СтрокаТЧ.НомерСтроки) = Неопределено) ИЛИ ОтработанныеСтроки.Найти(СтрокаТЧ.НомерСтроки) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Вложения = Новый Массив;
		Движение = СоздатьДвижениеРС_СобытиеПИР(ДвиженияСобытияПИР, СтрокаТЧ);
		СтрокаТЧ.Успех  = Ложь;
		СтрокаТЧ.Статус = "Ошибка";
		
		УдаляемыеФайлы = Новый Массив;
		Задача  = СтрокаТЧ.Основание;
		Абонент = СтрокаТЧ.Абонент;
		АдресЭП = МодульМНД.ПолучитьЭлектроннуюПочтуАбонента(Абонент);
		Район = ?(ЗначениеЗаполнено(СтрокаТЧ.Основание), СтрокаТЧ.Основание.Район, Абонент.Район);
		Отправитель = МодульМНД.ПолучитьУчетнуюЗаписьЭП(Район);
		
		Если Не ЗначениеЗаполнено(Отправитель) Тогда 
			СтрокаТЧ.Результат = "В территориальном органе не заполнена учетная запись";
			Движение.Результат = СтрокаТЧ.Результат;
			Продолжить;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(АдресЭП) Тогда 
			СтрокаТЧ.Результат = "Адрес электронной почты не заполнен.";
			Движение.Результат = СтрокаТЧ.Результат;
			Продолжить;
		КонецЕсли;
		
		Если ОтправкаУведомления Тогда
			Этап	  = Задача.Этап;
			ИмяМакета = МакетПечатнойФормы;
			
			// Отправка сообщения по макету этапа
			Тема			  = Строка(Этап) + " о задолженности за коммунальные услуги";
			ТипТекста		  = Перечисления.ТипыТекстовЭлектронныхПисем.HTML;
			ОбластиМакета	  = Новый Структура("БланкФилиала, Шапка");
			ТабличныйДокумент = Новый ТабличныйДокумент;
			ТабличныйДокумент.АвтоМасштаб = Истина;
			Справочники.энргВидыОперацийПИД.СформироватьПечатнуюФормуЭтапа(Задача, ИмяМакета, ТабличныйДокумент, ОбластиМакета);
			
			// Сохранение печатной формы во временный HTML-файл, с последующим полечнием текста данного файла
			ИмяТемпФайла = ПолучитьИмяВременногоФайла(".tmp"); 
			Попытка
				ТабличныйДокумент.Записать(ИмяТемпФайла, ТипФайлаТабличногоДокумента.HTML);
				УдаляемыеФайлы.Добавить(ИмяТемпФайла);
			Исключение
				СтрокаТЧ.Результат = "Не удалось создать  временный файл по адресу " + ИмяТемпФайла + " по причине: " + ОписаниеОшибки();
				Движение.Результат = СтрокаТЧ.Результат;
				УдалитьВременныеФайлы(УдаляемыеФайлы);
				Продолжить;
			КонецПопытки;
			
			// Получение тела письма
			ТекстHТМЛ = Новый ТекстовыйДокумент;
			ТекстHТМЛ.Прочитать(ИмяТемпФайла);
			ТекстHТМЛ = ТекстHТМЛ.ПолучитьТекст();
			
			ИмяПапки = СтрЗаменить(ИмяТемпФайла, ".tmp", "_files");
			УдаляемыеФайлы.Добавить(ИмяПапки);
			ИмяПапкиИзображений = СтрЗаменить(ИмяПапки, КаталогВременныхФайлов(), "");
			Тело = СтрЗаменить(ТекстHТМЛ, ИмяПапкиИзображений, ИмяПапки);
			
			// Формирование и сохранение квитанции в PDF
			ОбластиМакета = Новый Структура("Квитанция");
			Отказ = ФормированиеКвитанции(Вложения, Движение, Задача, ИмяМакета, СтрокаТЧ, УдаляемыеФайлы, ОбластиМакета);
			Если Отказ Тогда
				УдалитьВременныеФайлы(УдаляемыеФайлы);
				Продолжить;
			КонецЕсли;
			
			// Формирование и сохранение уведомления в PDF
			ОбластиМакета = Новый Структура("БланкФилиала, Шапка");
			Отказ = ФормированиеКвитанции(Вложения, Движение, Задача, ИмяМакета, СтрокаТЧ, УдаляемыеФайлы, ОбластиМакета, Строка(Этап));
			Если Отказ Тогда
				УдалитьВременныеФайлы(УдаляемыеФайлы);
				Продолжить;
			КонецЕсли;
		Иначе
			ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.РазмеченныйТекст;
			Тема = ТемаСобытия;
			Отказ = ЗаполнитьПоШаблону(Движение, СписокПарам, СтрокаТЧ, ТЗ_ЗначенияПарметров, Тело, Тема, СписокПарамТемы);
			Если Отказ Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		// Прикрепление фалов докуммента
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	энргСобытиеПрисоединенныеФайлы.Наименование КАК Наименование,
			|	ДвоичныеДанныеФайлов.ДвоичныеДанныеФайла КАК ДвоичныеДанныеФайла
			|ИЗ
			|	РегистрСведений.ДвоичныеДанныеФайлов КАК ДвоичныеДанныеФайлов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргСобытиеПрисоединенныеФайлы КАК энргСобытиеПрисоединенныеФайлы
			|		ПО ДвоичныеДанныеФайлов.Файл = энргСобытиеПрисоединенныеФайлы.Ссылка
			|ГДЕ
			|	энргСобытиеПрисоединенныеФайлы.ВладелецФайла = &Событие";
		
		Запрос.УстановитьПараметр("Событие", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Адрес = ПоместитьВоВременноеХранилище(Выборка.ДвоичныеДанныеФайла.Получить());
			Вложения.Добавить(Новый Структура("Представление, АдресВоВременномХранилище", Выборка.Наименование, Адрес));
		КонецЦикла;
		
		ПараметрыОтправки = Новый Структура("Кому, Тема, Тело, ТипТекста, Вложения", АдресЭП, Тема, Тело, ТипТекста, Вложения);
		Попытка
			РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(Отправитель, ПараметрыОтправки);
			
			СтрокаТЧ.Успех		= Истина;
			СтрокаТЧ.Статус		= "Отправлено";
			СтрокаТЧ.Результат	= "";
			//Движение.Результат	= СтрокаТЧ.Результат;
			Движение.Успех 		= Истина;
		Исключение
			СтрокаТЧ.Результат = ОписаниеОшибки();
			Движение.Результат = СтрокаТЧ.Результат;
		КонецПопытки;
		ОтработанныеСтроки.Добавить(СтрокаТЧ.НомерСтроки);
		
		ОтборПоАбоненту = Новый Структура;
		ОтборПоАбоненту.Вставить("Абонент",СтрокаТЧ.Абонент);
		НайденныеСтроки = Абоненты.НайтиСтроки(ОтборПоАбоненту);
		Для Каждого Дубль ИЗ НайденныеСтроки Цикл
			
			Если Дубль=СтрокаТЧ Тогда Продолжить КонецЕсли;
		    ОтработанныеСтроки.Добавить(Дубль.НомерСтроки);
			
			Движение = СоздатьДвижениеРС_СобытиеПИР(ДвиженияСобытияПИР, Дубль);
			Если СтрокаТЧ.Успех	 Тогда
				
				Дубль.Успех  	= Истина;
				Дубль.Статус	= "Отправлено";
				Дубль.Результат	= "";
				Движение.Успех 	= Истина;
			Иначе
				Дубль.Результат = ОписаниеОшибки();
				Движение.Результат = СтрокаТЧ.Результат;
			КонецЕсли;	
		КонецЦикла;	
		УдалитьВременныеФайлы(УдаляемыеФайлы);
	КонецЦикла;
		
КонецПроцедуры

Процедура ОтправкаSMS(ДвиженияСобытияПИР, СписокПарам, НомераСтрок)

	МодульМНД = Документы.энргСобытие;
	
	Если Не ОтправкаSMS.ДоступнаОтправкаSMS() Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет доступных учетных записей электронной почты.");
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(ТекстШаблона) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Незаполнен текст сообщения.");
		Возврат;
	КонецЕсли;
	
	ТЗ_ЗначенияПарметров = ПолучитьТаблицуЗначенийПараметров();
	
	Для каждого СтрокаТЧ Из Абоненты Цикл
		Если НомераСтрок <> Неопределено И НомераСтрок.Найти(СтрокаТЧ.НомерСтроки) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Движение = СоздатьДвижениеРС_СобытиеПИР(ДвиженияСобытияПИР, СтрокаТЧ);
		СтрокаТЧ.Успех	= Ложь;
		СтрокаТЧ.Статус = "Ошибка";
		
		Задача  = СтрокаТЧ.Основание;
		Абонент = СтрокаТЧ.Абонент;
		
		Телефон = МодульМНД.ПолучитьТелефонАбонента(Абонент);
		Если Не ЗначениеЗаполнено(Телефон) Тогда 
			СтрокаТЧ.Результат = "Телефон не заполнен.";
			Движение.Результат = СтрокаТЧ.Результат;
			Продолжить;
		КонецЕсли;

		Тело  = "";
		Отказ = ЗаполнитьПоШаблону(Движение, СписокПарам, СтрокаТЧ, ТЗ_ЗначенияПарметров, Тело);
		Если Отказ Тогда
			Продолжить;
		КонецЕсли;

		Попытка
			СписокТелефонов = Новый Массив;
			СписокТелефонов.Добавить(Телефон);
			
			Результат 		= ОтправкаSMS.ОтправитьSMS(СписокТелефонов, Тело, Строка(Организация));
		Исключение
			СтрокаТЧ.Результат = ОписаниеОшибки();
			Движение.Результат = СтрокаТЧ.Результат;
			Продолжить;
		КонецПопытки;
		
		Если ПустаяСтрока(Результат.ОписаниеОшибки) Тогда
			СтрокаТЧ.Успех		= Истина;
			СтрокаТЧ.Результат	= "";
			
			//Движение.Результат	= СтрокаТЧ.Результат;
			Движение.Успех 		= Истина;
		Иначе
			СтрокаТЧ.Результат = Результат.ОписаниеОшибки;
			Движение.Результат = СтрокаТЧ.Результат;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#Область ВспомогательныеМетоды

Функция ПолучитьТаблицуЗначенийПараметров()
	
	Перем ЗначПарам, СписокАбонентов, СписокЗадач, СтрокаТЗ, СтрокаТЧ, ТекЗначения, ТЗ_ЗначенияПарметров;
	
	СписокАбонентов	= Новый Массив;
	СписокЗадач		= Новый Массив;
	Для каждого СтрокаТЧ Из Абоненты Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.Основание) Тогда
			СписокЗадач.Добавить(СтрокаТЧ.Основание);
		ИначеЕсли ЗначениеЗаполнено(СтрокаТЧ.Абонент) Тогда 
			СписокАбонентов.Добавить(СтрокаТЧ.Абонент);
		КонецЕсли;
	КонецЦикла;	
	
	ЗначПарам = Справочники.энргШаблоныСообщений.ПолучитьЗначенияПараметров(СписокЗадач, СписокАбонентов);
	
	// Таблица значений для поиска значений параметров
	ТЗ_ЗначенияПарметров = Новый ТаблицаЗначений;              
	ТЗ_ЗначенияПарметров.Колонки.Добавить("Задача", Новый ОписаниеТипов("ЗадачаСсылка.энргЗадачаПИД"));
	ТЗ_ЗначенияПарметров.Колонки.Добавить("Абонент", Новый ОписаниеТипов("СправочникСсылка.энргАбоненты"));
	ТЗ_ЗначенияПарметров.Колонки.Добавить("Значения");
	
	Для каждого ТекЗначения Из ЗначПарам Цикл
		СтрокаТЗ = ТЗ_ЗначенияПарметров.Добавить();
		СтрокаТЗ.Задача   = ТекЗначения.Задача;
		СтрокаТЗ.Абонент  = ТекЗначения.Абонент;
		СтрокаТЗ.Значения = ТекЗначения;
	КонецЦикла;
	Возврат ТЗ_ЗначенияПарметров;
	
КонецФункции

Функция СоздатьДвижениеРС_СобытиеПИР(ДвиженияСобытияПИР, Знач СтрокаТЧ)
	
	Перем Движение;
	
	Движение = Неопределено;
	Для каждого ЗаписьРС Из ДвиженияСобытияПИР Цикл
		Если ЗаписьРС.Успех Или Не ЗначениеЗаполнено(ЗаписьРС.ПланируемаяДатаОтправки) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗаписьРС.Абонент = СтрокаТЧ.Абонент И ЗаписьРС.Основание = СтрокаТЧ.Основание И ЗаписьРС.ТипСобытия = ТипСобытия Тогда
			Движение = ЗаписьРС;
			Движение.ДатаПлан				 = Движение.ПланируемаяДатаОтправки;
			Движение.ПланируемаяДатаОтправки = Неопределено;
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Движение = Неопределено Тогда
		Движение = ДвиженияСобытияПИР.Добавить();
		Движение.Период 	= ТекущаяДатаСеанса();
		Движение.Абонент	= СтрокаТЧ.Абонент;
		Движение.ТипСобытия	= ТипСобытия;
		Движение.Основание	= СтрокаТЧ.Основание;
		Движение.Успех		= Ложь;
	КонецЕсли;
	
	Возврат Движение;
КонецФункции

Функция ЗаполнитьПоШаблону(Движение, СписокПарам, Знач СтрокаТЧ, Знач ТЗ_ЗначенияПарметров, Тело, Тема = Неопределено, СписокПарамТемы = Неопределено)
	
	Перем ТекСтрока;
	
	СпрШаблоны	= Справочники.энргШаблоныСообщений;
	Задача  	= СтрокаТЧ.Основание;
	Абонент		= СтрокаТЧ.Абонент;
	
	Если ЗначениеЗаполнено(Задача) Тогда
		ТекСтрока = ТЗ_ЗначенияПарметров.Найти(Задача);
	Иначе
		ТекСтрока = ТЗ_ЗначенияПарметров.Найти(Абонент);
	КонецЕсли;
	Если ТекСтрока = Неопределено Тогда
		СтрокаТЧ.Результат = "Неудалось получить данные о " + ?(ЗначениеЗаполнено(Задача), "задаче", "абоненте") + ".";
		Движение.Результат = СтрокаТЧ.Результат;
		Возврат Истина;
	КонецЕсли;
	Тело = СпрШаблоны.ЗаполнитьПараметрыШаблона(ТекстШаблона, ТекСтрока.Значения, СписокПарам);
	Если ПустаяСтрока(Тело) Тогда
		СтрокаТЧ.Результат = "Неудалось сформировать сообщение.";
		Движение.Результат = СтрокаТЧ.Результат;
		Возврат Истина;
	КонецЕсли;
	Если Тема <> Неопределено Тогда
		Тема = СпрШаблоны.ЗаполнитьПараметрыШаблона(ТемаСобытия, ТекСтрока.Значения, СписокПарамТемы);
		Если ПустаяСтрока(Тема) Тогда
			СтрокаТЧ.Результат = "Неудалось сформировать текст темы.";
			Движение.Результат = СтрокаТЧ.Результат;
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;

	Возврат Ложь;
КонецФункции

Функция ФормированиеКвитанции(Вложения, Движение, Знач Задача, Знач ИмяМакета, Знач СтрокаТЧ, УдаляемыеФайлы, ОбластиМакета, ИмяФайла = "Квитанция")
	
	Перем Адрес, ЕстьКвит, ИмяКаталогаPDF, ИмяТемпФайлаPDF, Отказ;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТекстОшибки = "";
	ЕстьКвит = Справочники.энргВидыОперацийПИД.СформироватьПечатнуюФормуЭтапа(Задача, ИмяМакета, ТабличныйДокумент, ОбластиМакета, ТекстОшибки);
	
	Если ЕстьКвит Тогда
		
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			СтрокаТЧ.Результат = ТекстОшибки;
			Движение.Результат = СтрокаТЧ.Результат;
			Возврат Истина;
		КонецЕсли;
		
		ИмяКаталогаPDF	= СтрЗаменить(ПолучитьИмяВременногоФайла(".tmp"), ".tmp", "");
		ИмяТемпФайлаPDF = ИмяКаталогаPDF + "\" + ИмяФайла + ".pdf"; 
		
		// Создание временного каталога
		Попытка
			СоздатьКаталог(ИмяКаталогаPDF);
			УдаляемыеФайлы.Добавить(ИмяКаталогаPDF);
		Исключение
			СтрокаТЧ.Результат = "Не удалось создать каталог для квитанции" + ИмяКаталогаPDF + " по причине: " + ОписаниеОшибки();
			Движение.Результат = СтрокаТЧ.Результат;
			Возврат Истина;
		КонецПопытки;
		
		Попытка
			ТабличныйДокумент.Записать(ИмяТемпФайлаPDF, ТипФайлаТабличногоДокумента.PDF);
			Адрес = ПоместитьВоВременноеХранилище(ИмяТемпФайлаPDF);
			Вложения.Добавить(Новый Структура("Представление, АдресВоВременномХранилище", "Квитанция", Адрес));
		Исключение
			СтрокаТЧ.Результат = "Не удалось создать  временный файл по адресу " + ИмяТемпФайлаPDF + " по причине: " + ОписаниеОшибки();
			Движение.Результат = СтрокаТЧ.Результат;
			Возврат Истина;
		КонецПопытки;
	КонецЕсли;
	Возврат Ложь;

КонецФункции

Процедура УдалитьВременныеФайлы(УдаляемыеФайлы)

	Для каждого ИмяФайла Из УдаляемыеФайлы Цикл
		Попытка
			УдалитьФайлы(ИмяФайла);
		Исключение
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти 

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
